#include <iostream>

int fib(int n)
{
    if (n == 0 || n == 1)
    {
        return 1;
    }

    return fib(n - 1) + fib(n - 2);
}

int fib2(int n)
{
    return n <= 1 ? 1 : fib2(n - 1) + fib2(n - 2);
}

int main()
{
    for (int i = 0; i < 10; i++)
    {
        std::cout << i + 1 << " - " << fib2(i) << std::endl;
    }
    

    std::cout << std::endl;
   
    std::cout << "Число фибаначи 5 = " << fib2(5) << std::endl;
    std::cout << "Число фибаначи 20 = " << fib2(20) << std::endl;
    std::cout << "Число фибаначи 9 = " << fib2(9) << std::endl;
    return 0;
}

// Число Фибоначчи для n = 1: Формула: F(1) = F(1-1) = F(0)                         = 1 (значение по умолчанию)
// Число Фибоначчи для n = 1: Формула: F(1) = F(1-1) = F(0)                         = 1 (значение по умолчанию)
// Число Фибоначчи для n = 2: Формула: F(2) = F(2-1) + F(2-2) = F(1) + F(0) = 1 + 1 = 2
// Число Фибоначчи для n = 3: Формула: F(3) = F(3-1) + F(3-2) = F(2) + F(1) = 2 + 1 = 3
// Число Фибоначчи для n = 4: Формула: F(4) = F(4-1) + F(4-2) = F(3) + F(2) = 3 + 2 = 5
// Число Фибоначчи для n = 5: Формула: F(5) = F(5-1) + F(5-2) = F(4) + F(3) = 5 + 3 = 8
// Число Фибоначчи для n = 6: Формула: F(6) = F(6-1) + F(6-2) = F(5) + F(4) = 8 + 5 = 13
// Число Фибоначчи для n = 4: Формула: F(7) = F(7-1) + F(7-2) = F(6) + F(5) = 13 + 8 = 21
// Число Фибоначчи для n = 5: Формула: F(8) = F(8-1) + F(8-2) = F(7) + F(6) = 21 + 13 = 34
// Число Фибоначчи для n = 6: Формула: F(9) = F(9-1) + F(9-2) = F(8) + F(7) = 34 + 21 = 55
